""" Модуль для сообщений """

MES_PROGRAM_NAME = "Программа для сокращения интернет-адресов"
MES_BEGIN = (
                  "Введите\n"
                  "1 - регистрация короткого интернет-адреса по стандартному\n"
                  "2 - получение и проверка домашней страницы интернет-адреса по псевдониму\n"
                  "3 - получение и проверка стандартного интернет-адреса по короткому\n"
                  "4 - получение всех пар адресов\n"
                  "5 - завершение программы\n"
                   )

MES_NOT_FOUND = "Сандартный интернет-адрес не найден"
MES_SHORT_URL = "Короткий интернет-адрес:"
MES_ALIAS = "Псевдоним домашней страницы:"
MES_STANDART_URL = "Стандартный интернет-адрес:"
MES_HOME_URL = "Адрес домашней страницы:"
MES_STATUS = "Код ответа страницы:"

MES_CHOICE = "Ваш выбор: "
MES_INPUT = "Введите "
MES_INPUT_URL = "Введите стандартный url для регистрации: "

MES_RUN_TIME = "Время выполнения программы"
MES_SECONDS = "сек"
MES_LOG_RUN_FUNC = "Выполнена функция"
MES_ERROR = "Возникла ошибка"
MES_WRONG_URL = "Введите полный адрес"
MES_NO_ACCESS = "Некорректный адрес. Нет доступа к странице."
MES_NO_FOUND = "Объект не найден"
